DataProcessors/РабочийСтолЮриста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтолЮриста</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСделки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗадачаИсполнителя</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеЮриста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеУПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеИБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РабочийСтолЮриста/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьНадписи(ЭтаФорма.Элементы, ПользователиКлиентСервер.ТекущийПользователь());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписи(Элементы, ТекущийПользователь)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров(ТекущийПользователь);
	
	Если СтруктураПараметров <> Неопределено Тогда
		Элементы.ЗаявкиНаСделку.Заголовок = "Заявки на сделку (" + СтруктураПараметров.ЧислоЗаявокНаСделку + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаСделку(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Проведен", Истина);
	ПараметрыФормы.Вставить("Проект", ПолучитьСписокПроектов(ПользователиКлиентСервер.ТекущийПользователь()));
	
	ТекущаяДата = ТекущаяДата();
	ПараметрыФормы.Вставить("ДатаОт", НачалоДня(ТекущаяДата));
	ПараметрыФормы.Вставить("ДатаДо", КонецДня(ТекущаяДата));
	//ПараметрыФормы.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыСделки.СогласованиеЮриста"));
	ПараметрыФормы.Вставить("ОтборДляЮристов", Истина);
	
	ФормаСписка = ПолучитьФорму("Документ.ЗаявкаНаСделку.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	Если ФормаСписка.Открыта() Тогда
		ФормаСписка.КонтекстВыбора = ПараметрыФормы;
	КонецЕсли;
	ФормаСписка.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметров(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫРАЗИТЬ(ИсполнителиЗадач.ОсновнойОбъектАдресации КАК Справочник.Проекты) КАК Проект
	               |ПОМЕСТИТЬ ВТ_СписокПроектов
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.Исполнитель = &Исполнитель
	               |	И ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Юристы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаСделку.Ссылка) КАК КоличествоДокументов
	               |ПОМЕСТИТЬ ВТ_ПоЗаявкам
	               |ИЗ
	               |	Документ.ЗаявкаНаСделку КАК ЗаявкаНаСделку
	               |ГДЕ
	               |	ЗаявкаНаСделку.Дата МЕЖДУ &НачалоДня И &КонецДня
	               |	И ЗаявкаНаСделку.Проект В
	               |			(ВЫБРАТЬ
	               |				ВТ_СписокПроектов.Проект КАК Проект
	               |			ИЗ
	               |				ВТ_СписокПроектов КАК ВТ_СписокПроектов)
	               |	И ЗаявкаНаСделку.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатусыСделкиСрезПоследних.ЗаявкаНаСделку) КАК КоличествоДокументов
	               |ИЗ
	               |	РегистрСведений.СтатусыСделки.СрезПоследних(
	               |			&КонецДня,
	               |			ЗаявкаНаСделку.Проект В
	               |				(ВЫБРАТЬ
	               |					ВТ_СписокПроектов.Проект КАК Проект
	               |				ИЗ
	               |					ВТ_СписокПроектов КАК ВТ_СписокПроектов)) КАК СтатусыСделкиСрезПоследних
	               |ГДЕ
	               |	СтатусыСделкиСрезПоследних.Период >= &НачалоДня
	               |	И СтатусыСделкиСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСделки.СогласованиеЮриста)";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	
	ТекущаяДата = ТекущаяДата();
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		СтруктураПараметров = Новый Структура;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СтруктураПараметров.Вставить("ЧислоЗаявокНаСделку", Выборка.КоличествоДокументов);
		
		Возврат СтруктураПараметров;
	КонецЕсли;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьСписокПроектов(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫРАЗИТЬ(ИсполнителиЗадач.ОсновнойОбъектАдресации КАК Справочник.Проекты) КАК Проект
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.Исполнитель = &Исполнитель
	               |	И ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Юристы)";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Список = Новый СписокЗначений;
		
		Пока Выборка.Следующий() Цикл
			Список.Добавить(Выборка.Проект);
		КонецЦикла;
		
		Возврат Список;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьНадписиВЗаголовках", 300);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписиВЗаголовках()

	ОбновитьНадписи(ЭтаФорма.Элементы, ПользователиКлиентСервер.ТекущийПользователь());
	
КонецПроцедуры
